Repository: eXceptionCoders/ThePersonalTrainerClubIOS
Catalog: ThePersonalTrainerClub/ThePersonalTrainerClub/*.lproj/Localizable.strings
Languages: es

# login_email_placeholder
source: user@domain.com
es: usuario@dominio.com

# login_password_placeholder
source: Password
es: Contraseña

# login_register_button
source: Register
es: Registro

# login_error_empty_field
source: There are empty fields
es: Debes rellenar todos los campos

# login_error_wrong_user
source: User or password incorrect
es: Usuario o password incorrecto

# login_error_invalid_email
source: Wrong_email
es: El email está mal escrito

# login_error_default
source: An error occurs while login
es: Ha ocurrido un error durante el login

# register_name_placeholder
source: Name
es: Nombre

# register_last_name_placeholder
source: Last name
es: Apellido

# register_gender_male_title
source: Male
es: Hombre

# register_gender_female_title
source: Female
es: Mujer

# register_password_placeholder
source: Password
es: Contraseña

# register_trainer_label_text
source: Are you a trainer?
es: ¿Eres entrenador?

# register_sign_up_button
source: Sign up
es: Registro

# register_error_empty_field
source: Please fill all required fields
es: Rellene todos los campos

# register_server_error
source: Some error has occurred
es: Ha ocurrido algún error

# newclass_title
source: New Class
es: Crear clase

# newclass_whatactivity_label
source: What activity do you want to teach?
es: Que actividad impartes?

# newclass_where_label
source: Where do you teach?
es: Donde la impartes?

# newclass_assistance_label
source: Maximum assistance: %.0f
es: Máxima asistencia: %.0f

# newclass_price_label
source: Price by class: %.2f €
es: Precio por clase: %.2f €

# newclass_description_label
source: Description
es: Descripción

# newclass_save_button
source: Save class
es: Salvar clase

# newclass_checkfields
source: Please, fills the required fields
es: Rellene los campos requeridos

# newclass_server_error
source: Some error has occurred
es: Ha ocurrido algún error

# newclass_class_created
source: Class created successfully
es: Clase creada

# type_selection_title
source: Switch to %@
es: Usar como %@

# type_selection_title_label
source: Choose your role
es: Elige tu estado

# type_selection_trainer
source: trainer
es: entrenador

# type_selection_athlete
source: athlete
es: deportista

# trainer_management_title
source: Management
es: Gestión

# trainer_management_trainer_label
source: Trainer
es: Entrenador

# trainer_management_name_unknown_first_text
source: Name:
es: Nombre:

# trainer_management_name_unknown_second_text
source: Unknown
es: Desconocido

# trainer_management_sports_label
source: What do you teach?
es: ¿Qué enseñas?

# trainer_management_locations_label
source: Where do you teach?
es: ¿Dónde enseñas?

# trainer_management_lessons_label
source: Open lessons
es: Clases abiertas

# add_sport_title
source: Set activity
es: Alta deporte

# add_sport_error
source: Error setting activities
es: Error al añadir deportes

# athlete_management_title
source: Management
es: Gestión

# athlete_management_trainer_label
source: Athlete
es: Deportista

# athlete_management_name_unknown_first_text
source: Name:
es: Nombre:

# athlete_management_name_unknown_second_text
source: Unknown
es: Desconocido

# athlete_management_sports_label
source: What do you practise?
es: ¿Qué practicas?

# athlete_management_locations_label
source: Where do you find classes?
es: ¿Dónde buscas clases?

# athlete_management_lessons_label
source: Open lessons
es: Clases abiertas

# cancel_button_title
source: Cancel
es: Cancelar

# booking_button_title
source: Book
es: Reservar

# trainer_title_label
source: Trainer
es: Entrenador

# remove_location_title
source: Delete location
es: Borrar ubicación

# remove_location_message
source: Do you want to delete the "%@" location?
es: ¿Quieres borrar la ubicación "%@"?

# remove_button_title
source: Delete
es: Borrar

# remove_location_error
source: Some error has occurred
es: Ha ocurrido algún error

# add_location_search_placeholder
source: Search for places
es: Busca ubicaciones

# add_location_set_location_title
source: Set new location
es: Añadir una nueva ubicación

# add_location_location_description_placeholder
source: Location description
es: Descripción

# add_location_location_placeholder
source: Location
es: Ubicación

# add_location_use_current_location_button_title
source: Use current location
es: Usar ubicación actual

# add_location_save_button_title
source: Save
es: Guardar

# add_location_no_address_found
source: No matching addresses found
es: No existe una ubicación que coincida

# add_location_no_last_location_message
source: No last location known
es: No existe una última ubicación del usuario

# add_location_user_location_error_message
source: Cannot get user location
es: No se puede obtener la ubicación

# add_location_on_save_error_message
source: You need to provide a description and a location
es: Necesitas proveer una descripción y una ubicación

# add_location_server_error
source: Some error has occurred
es: Ha ocurrido algún error

# class_finder_title
source: Search classes
es: Buscar clases

# class_finder_activity_label
source: What activity are you looking for?
es: ¿Qué actividad estás buscando?

# class_finder_location_label
source: Where are you looking for?
es: ¿Dónde estás buscando?

# class_finder_distance_label
source: In a radio of %.0f Km
es: En un radio de %.0f Km

# class_finder_price_label
source: Price: %@
es: Precio: %@

# class_finder_search_button
source: Search
es: Buscar

# class_finder_any_label
source: Any
es: Cualquiera

# class_finder_result_title
source: Classes
es: Clases

# class_finder_result_found
source: %d classes found
es: %d clases

# class_finder_result_classes_not_found
source: Sorry, still there are not classes available with the criteria specified
es: Lo sentimos, todavía no hay clases disponibles con los criterios especificados.

# class_finder_result_server_error
source: Some error has occurred
es: Ha ocurrido algún error

# class_detail_title
source: Class
es: Clase

# class_detail_trainer_laabel
source: Trainer
es: Entrenador

# user_settings_title
source: User Settings
es: Ajustes de usuario
